Revit 2027 API
MEPCalculationServerInfo.ServerId Property
 The Id of the server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid ServerId { get; set; }
Public Property ServerId As Guid
	Get
	Set
public:
property Guid ServerId {
	Guid get ();
	void set (Guid value);
}
member ServerId : Guid with get, set
Property Value
Guid
See Also
Reference
MEPCalculationServerInfo Class
Autodesk.Revit.DB Namespace